Tutorials/reactingLagrangianQGDFoam/gasDiffusion/0/e
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      e;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 1434000;

boundaryField
{
    fuel
    {
        type            fixedEnergy;
        value           uniform 671637;
    }
    air
    {
        type            fixedEnergy;
        value           uniform 284351.465625;
    }
    outlet
    {
        type            mixedEnergy;
        refValue        uniform 281781;
        refGradient     uniform 0;
        valueFraction   uniform 0;
        value           uniform 281781;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
